Tekla Open API Reference for Tekla Structures 2025
DatabaseObject.GetDoubleUserProperties Method (List<String>, Dictionary<String, Double>)
 Retrieves all double user properties for the object with the given list of names.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool GetDoubleUserProperties(
	List<string> names,
	out Dictionary<string, double> values
)
Public Function GetDoubleUserProperties (
	names As List(Of String),
	<OutAttribute> ByRef values As Dictionary(Of String, Double)
) As Boolean
Parameters
names
Type: System.Collections.Generic.List<String>
List of names to get the values for.
values
Type: System.Collections.Generic.Dictionary<String, Double>
Dictionary of name/value pairs that contain the values of the found user properties with the given names.
Return Value
Type: Boolean
True if the request succeeded (the returned values can still be empty if no such UserProperties were found).
See Also
Reference
DatabaseObject Class
GetDoubleUserProperties Overload
Tekla.Structures.Drawing Namespace